app/Http/Controllers/CategoryController.php

    public function list()
    {
        // $allCategory=Category::all();
        $allCategory=Category::paginate(5);
        $allCategory=Category::with('parent')->paginate(20);
---
select * from `categories` limit 5 offset 0
select count(*) as aggregate from `categories`
select * from `categories` where `categories`.`id` in (null)